frontend/models/company/CompanySearch.php

SELECT * FROM `User_Info` WHERE (`id`=1) AND (`enable`='Y')
---
    public function search($params)
    {
        $query = Company::find();

        // add conditions that should always apply here
        $id = Yii::$app->user->id;
        $userInfo = UserInfo::find()->where(['id' => $id, 'enable' => 'Y'])->one();