frontend/models/fotaSrc/FileExtend.php

SELECT * FROM `Software` WHERE `sw_puid`='1'
---
    public function getSoftwareList()
    {
        $puidId = Yii::$app->user->getUserCache('puidId');
        $this->versionList = Software::find()->where(['sw_puid' => $puidId])->all();